# Dealing with Duplicate data

In [1]:
import pandas as pd

In [3]:
 df = pd.DataFrame({'A':[1,2,3,3,2],
 'B':[1,7,3,0,8]})

df

   A  B
0  1  1
1  2  7
2  3  3
3  3  0
4  2  8

In [6]:
mask = df.A.duplicated(keep=False)
mask

0    False
1     True
2     True
3     True
4     True
Name: A, dtype: bool

In [8]:
df.loc[mask,'B'] = 0

In [9]:
df['C'] = df.A.mask(mask,0)

df

   A  B  C
0  1  1  1
1  2  0  0
2  3  0  0
3  3  0  0
4  2  0  0

If need set value 0 to column B, where in column A are duplicated data first create mask by
Series.duplicated and then use Series.mask:

### d invert mask use ~:

In [10]:
df['C'] = df.A.mask(~mask, 0)

df

   A  B  C
0  1  1  0
1  2  0  2
2  3  0  3
3  3  0  3
4  2  0  2

### Drop duplicated
    pd.drop_duplicate

In [13]:
df = pd.DataFrame({'A':[1,2,3,3,2],
'B':[1,7,3,0,8]})
df

   A  B
0  1  1
1  2  7
2  3  3
3  3  0
4  2  8

In [14]:
# keep only the last value
df.drop_duplicates(subset=['A'], keep='last')

   A  B
0  1  1
3  3  0
4  2  8

In [15]:
# keep only the first value, default value
df.drop_duplicates(subset=['A'], keep='first')

   A  B
0  1  1
1  2  7
2  3  3

In [17]:
# drop all duplicated values
df.drop_duplicates(subset=['A'], keep=False)

   A  B
0  1  1

### When you don't want to get a copy of a data frame, but to modify the existing one:

In [20]:
df = pd.DataFrame({'A':[1,2,3,3,2],
 'B':[1,7,3,0,8]})
df

   A  B
0  1  1
1  2  7
2  3  3
3  3  0
4  2  8

In [19]:
df.drop_duplicates(subset=['A'], inplace=True)

df

   A  B
0  1  1
1  2  7
2  3  3

### Counting and getting unique elements

#### Number of unique elements in a series:

In [21]:
 id_numbers = pd.Series([111, 112, 112, 114, 115, 118, 114, 118, 112])

id_numbers.nunique()

5

#### Get unique elements in a series:

In [22]:
id_numbers.unique()

array([111, 112, 114, 115, 118], dtype=int64)

#### Number of unique elements in each group:

In [23]:
df = pd.DataFrame({'Group': list('ABAABABAAB'),
 'ID': [1, 1, 2, 3, 3, 2, 1, 2, 1, 3]})

df

  Group  ID
0     A   1
1     B   1
2     A   2
3     A   3
4     B   3
5     A   2
6     B   1
7     A   2
8     A   1
9     B   3

In [24]:
 df.groupby('Group')['ID'].nunique()

Group
A    3
B    2
Name: ID, dtype: int64

#### Get of unique elements in each group:

In [25]:
 df.groupby('Group')['ID'].unique()

Group
A    [1, 2, 3]
B       [1, 3]
Name: ID, dtype: object

#### Get unique values from a column

In [26]:
df = pd.DataFrame({"A":[1,1,2,3,1,1],"B":[5,4,3,4,6,7]})

df["A"].unique()

array([1, 2, 3], dtype=int64)

In [27]:
df["B"].unique()

array([5, 4, 3, 6, 7], dtype=int64)

##### To get the unique values in column A as a list (note that unique() can be used in two slightly  different ways)

In [28]:
pd.unique(df['A']).tolist()

[1, 2, 3]

### Here is a more complex example. Say we want to find the unique values from column 'B' where 'A' is equal to 1.

First, let's introduce a duplicate so you can see how it works. Let's replace the 6 in row '4', column
'B' with a 4:

In [30]:
df.loc['4', 'B'] = 4
df

     A    B
0  1.0  5.0
1  1.0  4.0
2  2.0  3.0
3  3.0  4.0
4  1.0  6.0
5  1.0  7.0
4  NaN  4.0

In [32]:
pd.unique(df[df['A'] == 1]['B']).tolist()

[5.0, 4.0, 6.0, 7.0]

### Explanation

This can be broken down by thinking of the inner DataFrame first:
    
df['A'] == 1

This finds values in column A that are equal to 1, and applies True or False to them. We can then
use this to select values from column 'B' of the DataFrame (the outer DataFrame selection)
For comparison, here is the list if we don't use unique. It retrieves every value in column 'B' where
column 'A' is 1.

In [34]:
df[df['A'] == 1]['B'].tolist()

[5.0, 4.0, 6.0, 7.0]